In [1]:
import pandas as pd

# Задание №1

In [2]:
rating = pd.read_csv('ratings.csv')
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [3]:
rating_sort = rating [ (rating['rating'] == 5.0)]
rating_sort['movieId'].value_counts(normalize=True).head()
movies[movies['movieId'] == 318]['title'].head()

277    Shawshank Redemption, The (1994)
Name: title, dtype: object

# Задание №2

In [4]:
df = pd.read_csv('power.csv')
df.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [5]:
fc = df[ (df['country']=='Latvia') | (df['country']=='Litva') | (df['country']=='Estonia') ]
fc1 = fc[ (fc['category']==4) | (fc['category']==12) | (fc['category']==21) ]
fc2 = fc1[ (fc1['year'] <= 2010) & (fc1['year'] >= 2005)]
fc3 = fc2[ (fc2['quantity'] >= 0)]
fc3['quantity'].sum()

118284.0

# Задание №3

In [6]:
page_url = 'https://smart-lab.ru/q/shares/'
df1 = pd.read_html(page_url, attrs = {'class': 'simple-little-table trades-table'}, encoding='utf-8')

In [7]:
df1[:2]

[         № Unnamed: 1     Название  Тикер  Unnamed: 4  Unnamed: 5  Цена, посл  \
 0      NaN   13:47:00  Индекс ММВБ  IMOEX         NaN         NaN     2902.65
 1      1.0   13:31:58     Сбербанк   SBER         NaN         NaN      228.42
 2      2.0   13:31:58   ГАЗПРОМ ао   GAZP         NaN         NaN      179.72
 3      3.0   13:31:58       ЛУКОЙЛ   LKOH         NaN         NaN     4538.00
 4      4.0   13:31:54   Yandex clA   YNDX         NaN         NaN     4574.80
 ..     ...        ...          ...    ...         ...         ...         ...
 269  269.0   10:00:13   КосогМЗ ао   KMTZ         NaN         NaN         NaN
 270  270.0   10:00:13    Физика ао   NPOF         NaN         NaN         NaN
 271  271.0   10:00:13   ГАЗ-Тек ао   GAZT         NaN         NaN         NaN
 272  272.0   10:00:13   Уркалий-ао   URKA         NaN         NaN         NaN
 273  273.0   10:00:12    ТАНТАЛ ап  TANLP         NaN         NaN         NaN

      Изм, % Объем, млн руб 1 нед, %  1 м, %  ytd, %  12м, % Капит-я млрд руб  \
 0    +1.36%      36 077.39    -2.6%   -3.1%   -4.7%   +3.8%        46 070.85
 1    +0.96%       5 958.66    -1.1%   -1.0%  -10.3%   -1.5%         5 175.62
 2    +1.44%       3 483.60    -1.7%   -2.4%  -29.9%  -22.0%         4 261.23
 3     +0.6%       3 375.35    -6.8%  -10.8%  -26.4%  -17.3%         3 137.99
 4    +1.04%       2 407.99    -3.2%   -3.8%  +69.6%  +94.7%         1 455.93
 ..      ...            ...      ...     ...     ...     ...              ...
 269      0%            NaN      NaN     NaN     NaN     NaN              NaN
 270      0%            NaN      NaN     NaN     NaN     NaN             1.07
 271      0%            NaN      NaN     NaN     NaN     NaN            40.07
 272      0%            NaN      NaN     NaN     NaN     NaN           151.01
 273      0%            NaN      NaN     NaN     NaN     NaN             0.21

      Капит-я млрд $ ИзмОбъема Изм позпо Объему Unnamed: 17 Unnamed: 18
 0            604.04       -1%                —           —           —
 1             67.86      -12%              NaN           +           +
 2             55.87       -4%              NaN           +           +
 3             41.14       -4%              NaN           +           +
 4             19.09      +81%               +2           +           +
 ..              ...       ...              ...         ...         ...
 269             NaN       NaN              NaN           +           +
 270            0.01       NaN              NaN           +           +
 271            0.53       NaN              NaN           +           +
 272            1.98       NaN              NaN           +           +
 273            0.00       NaN              NaN           +           +

 [274 rows x 19 columns]]